mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
        // check if any Lead is off
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            BSP_ECG_ADS1192_detectLeadOff(inDevice, &ecgErr);
        }

        // check if RLD is off
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            BSP_ECG_ADS1192_detectRldOff(inDevice, &ecgErr);
        }



//        BSP_ECG_ADS1192_measureRldSignal(inDevice, &ecgErr);

//        // set both channels to input short (offset measurements)
//        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//            uint8_t chRegs[2] = { 1u, 1u };
//            BSP_ECG_ADS1192_writeSingleReg(inDevice,
//                                     BSP_ECG_ADS1192_reg_CH1_SET,
//                                     2u,
//                                     (uint8_t *) &chRegs,
//                                     2u,
//                                     &ecgErr);
//        }

//        uint32_t drdy = nrf_gpio_pin_read(ECG_DRDY);
//        uint8_t outBuffer[16] = { 0u };
//        // START pin is set to 1 already (pulled to VCC)
//        // begin reading data from device
//        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);
//        // nDRDY should be 0 now
//        drdy = nrf_gpio_pin_read(ECG_DRDY);
//        // read data shifted out from device
//        // 16 status bits + 2 channels x 16 bits
//        BSP_ECG_ADS1192_readData(inDevice, 16, &outBuffer[0], &ecgErr);
//        for(uint8_t i = 0u; i<16; i++) {
//            SEGGER_RTT_printf(0, "%x\n", outBuffer[i]);
//        }
//        drdy = nrf_gpio_pin_read(ECG_DRDY);
//        // stop reading data
//        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);
//
//        // now do test signal
//        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//            BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0u };
//            conf2Reg.R = 0xA3u;
//            BSP_ECG_ADS1192_writeSingleReg(inDevice,
//                                     BSP_ECG_ADS1192_reg_CONFIG_2,
//                                     (uint8_t *) &conf2Reg,
//                                     &ecgErr);
//        }
//        // set both channels to test signal
//        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//            uint8_t chRegs[2] = { 5u, 5u };
//            BSP_ECG_ADS1192_writeSingleReg(inDevice,
//                                     BSP_ECG_ADS1192_reg_CH1_SET,
//                                     2u,
//                                     &chRegs[0],
//                                     2u,
//                                     &ecgErr);
//        }
//        uint8_t outBuffer2[18] = { 0u };
//        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);
//        SEGGER_RTT_printf(0, "--------------\n");
//        BSP_ECG_ADS1192_readData(inDevice, 18, &outBuffer2[0], &ecgErr);
//        for(uint8_t i = 0u; i<18; i++) {
//            SEGGER_RTT_printf(0, "%x\n", outBuffer2[i]);
//        }
//        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);

        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            inDevice->isInitialized = true;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 *                         PRIVATE FUNCTION DEFINITIONS
 ******************************************************************************/
/*******************************************************************************
 * @brief Function sends predefined SPI command to the device.
 ******************************************************************************
 * @param [in]  *inDevice - device structure for ECG driver.
 * @param [in]  inSpiCmd  - SPI command.
 * @param [out] *outErr   - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    24.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_sendSpiCommand(BSP_ECG_ADS1192_device_S *inDevice,
        const uint8_t inSpiCmd,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint32_t ret_code;
    uint8_t txBufferLen = 1u;
    uint8_t rxBufferLen= 0u;

    if(inDevice == NULL) {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    } else {
        ret_code = nrf_drv_spi_transfer(inDevice->config->spiInstance,
                                        &inSpiCmd,
                                        txBufferLen,
                                        NULL,
                                        rxBufferLen);
        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for writing to single register of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inReg        - register address.
 * @param [in]  *inData      - pointer to data to be sent.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_writeSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
        const BSP_ECG_ADS1192_reg_E inReg,
        const uint8_t *inData,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t opcode[BSP_ECG_ADS1192_SPI_OPCODE_SIZE_W] = { 0u };
    uint8_t regAddr = ecgADS1192RegAddr[inReg];
    uint8_t rxBufferLen = 0u;
    uint8_t txBufferLen = BSP_ECG_ADS1192_SPI_OPCODE_SIZE_W;
    uint32_t ret_code;

    if((inDevice != NULL) && (inData != NULL)) {
        /* byte format for Read opcode: | 001R RRRR | 000N NNNN | DATA |
         * RRRR - regAddr, NNNN - number of registers to write to */
        opcode[0] = BSP_ECG_ADS1192_SPI_WRITE_OP | regAddr;
        opcode[1] = BSP_ECG_ADS1192_SPI_SINGLE_REG;
        opcode[2] = *inData;

        // leave RX buffer empty, function allows it
        ret_code = nrf_drv_spi_transfer(&spi0Instance, &(opcode[0]), txBufferLen, NULL, rxBufferLen);

        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

