mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 * @brief Function for reading from single register of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inReg        - starting register address.
 * @param [out] *outData     - pointer to data to be read.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static uint8_t BSP_ECG_ADS1192_readSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
        const BSP_ECG_ADS1192_reg_E inReg,
        uint8_t *outData,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t retVal = 0xFFu;
    uint32_t ret_code;
    uint8_t opcode[BSP_ECG_ADS1192_SPI_OPCODE_SIZE_R] = { 0u };
    uint8_t txBufferLen = BSP_ECG_ADS1192_SPI_OPCODE_SIZE_R;
    uint8_t rxBufferLen = BSP_ECG_ADS1192_SPI_OPCODE_SIZE_R + BSP_ECG_ADS1192_SPI_READ_OFFSET;
    uint8_t regAddr = ecgADS1192RegAddr[inReg];

    if((inDevice != NULL) && (outData != NULL)) {
        /* byte format for Read opcode: | 001R RRRR | 000N NNNN |
         * RRRR - regAddr, NNNN - number of registers to read */
        opcode[0] = BSP_ECG_ADS1192_SPI_READ_OP | regAddr;
        opcode[1] = BSP_ECG_ADS1192_SPI_SINGLE_REG;

        // start SPI transfer
        ret_code = nrf_drv_spi_transfer(&spi0Instance,
                                        &(opcode[0]),
                                        txBufferLen,
                                        &(outData[0]),
                                        rxBufferLen);

        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        } else {
            retVal = outData[BSP_ECG_ADS1192_SPI_REG_VALUE_INDEX];
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }

    return retVal;

}

/*******************************************************************************
 * @brief Function for reading data shifted out of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inSize       - length (in bytes) of data to be read.
 * @param [out] *outData     - pointer to data to be read.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    01.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readData(BSP_ECG_ADS1192_device_S *inDevice,
        const uint8_t inSize,
        uint8_t *outData,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint32_t ret_code;
    uint8_t txBufferLen = 0u;
    uint8_t rxBufferLen = inSize;

    if((inDevice != NULL) && (outData != NULL)) {
        // start SPI transfer
        ret_code = nrf_drv_spi_transfer(&spi0Instance,
                                        NULL,
                                        txBufferLen,
                                        outData,
                                        rxBufferLen);
        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function activates reset impulse needed on device initialization.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    08.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_initReset(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set nRESET pin high
    nrf_gpio_pin_set(ECG_RST);
    // wait 1s, according to datasheet power-up sequence
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    /* hold nRESET low for 1 period of fMOD frequency,
     * according to datasheet, fMOD = 128kHz -> tMOD = 8us*/
    nrf_gpio_pin_clear(ECG_RST);
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_1_FMOD);

    // set nRESET pin high again
    nrf_gpio_pin_set(ECG_RST);

    // wait 18 * tCLK, with fCLK = 512kHz -> tCLK = 2us
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_18_TCLK);

    // reset device registers to default values
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RESET, &ecgErr);
    // wait 9 * fMOD cycles for RESET command to finish executing
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_9_FMOD);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Sets device MUX to read temperature from device sensor.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_updateTemperature(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[6] = { 0u };

    // set channel 2 for temp measurement
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
        // set PGA to 1x
        chReg.B.pga = 1u;
        chReg.B.mux = 4u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH2_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }

    // enable calibrating PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        uint8_t calib = 0x80u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_MISC_2,
                                 (uint8_t *) &calib,
                                 &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);

    // start reading data
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);

