mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
    // read data shifted out from device
    // 16 status bits + 2 channels x 16 bits
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_readData(inDevice, 6, &outBuffer[0], &ecgErr);
    }
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_4_TCLK);

    // get read temperature bytes from ADC
    int16_t readVal = outBuffer[4] << BSP_ECG_ADS1192_TEMP_BIT_MASK;
    readVal = readVal | outBuffer[5];
    // set device temperature
    inDevice->temperature = (((readVal - BSP_ECG_ADS1192_TEMP_CONST_1) / BSP_ECG_ADS1192_TEMP_CONST_2)
            + BSP_ECG_ADS1192_TEMP_CONST_3);

    // set channel 2 back to default settings
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH2_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }

    // enable calibrating PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        uint8_t calib = 0x80u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_MISC_2,
                                 (uint8_t *) &calib,
                                 &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function configures registers to output test signal.
 * @details Sets output of both channels to signal with amplitude
 *          +-(VREFP - VREFN) / 2420. In this case, VREFP = 2.42V, VREFN = 0V.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readTestSignal(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[255] = { 0 };
    int16_t ecgData[128] = { 0 };

    // set CONFIG 2 register for test signal
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbRefBuf = 1u;
    conf2Reg.B.intTest = 1u;
    conf2Reg.B.testFreq = 1u;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
                             BSP_ECG_ADS1192_reg_CONFIG_2,
                             (uint8_t *) &conf2Reg,
                             &ecgErr);
    //TODO: [mario.kodba 05-12-2020] check if this is needed
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
    chReg.B.mux = BSP_ECG_ADS1192_MUX_TEST_SIGNAL;
    // set both channels to output test signal
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH1_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH2_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }

    // enable calibrating PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        uint8_t calib = 0x80u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_MISC_2,
                                 (uint8_t *) &calib,
                                 &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);

    // issue read continuous command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // read data shifted out from device
        // 16 status bits + 2 channels x 16 bits
        BSP_ECG_ADS1192_readData(inDevice, 255, &outBuffer[0], &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // convert SPI data to proper format
        BSP_ECG_ADS1192_convertSignal(&outBuffer[0],
                255,
                &ecgData[0],
                &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // issue stop read data continuous command
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);
        // wait 4 * tCLK after sending SDATAC command
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function detects if any of the electrodes is disconnected.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    29.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_detectLeadOff(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set Lead-off comparator threshold
    uint8_t loffReg = BSP_ECG_ADS1192_LEAD_OFF_THRESHOLD;
    BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF, &loffReg, &ecgErr);

    // configure Configuration 2 register for lead-off detection
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbLoffComp = 1u;
    conf2Reg.B.pdbRefBuf = 1u;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                       BSP_ECG_ADS1192_reg_CONFIG_2,
                                       (uint8_t *) &conf2Reg,
                                       &ecgErr);
    }
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    // configure LOFF_SENS register - both channels P+ and N- for lead-off detection
    uint8_t loffSensReg = BSP_ECG_ADS1192_LEAD_OFF_BOTH_CHANNELS;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF_SENS, &loffSensReg, &ecgErr);
    }

//    // configure RLD_SENS register - both channels P+ and N- for lead-off detection
//    uint8_t rldSensReg = 0x1Fu;
//    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_RLD_SENS, &rldSensReg, &ecgErr);
//    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // issue read command
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);
    }

