mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
    // read Lead-off Status register
    uint8_t outData[10] = { 0u };
    uint8_t status;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        status = BSP_ECG_ADS1192_readSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF_STAT, &(outData[0]), &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // check if any LEAD_OFF bit is set
        if((status & BSP_ECG_ADS1192_LEAD_OFF_MASK) != false) {
            ecgErr = BSP_ECG_ADS1192_err_LEAD_OFF;
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function detects if Right Leg Drive (RLD) electrode is disconnected.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    03.12.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_detectRldOff(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set Lead-off comparator threshold
    uint8_t loffReg = BSP_ECG_ADS1192_LEAD_OFF_THRESHOLD;
    BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF, &loffReg, &ecgErr);

    // configure Configuration 2 register for lead-off detection
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbLoffComp = 1u;
    conf2Reg.B.pdbRefBuf = 1u;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                       BSP_ECG_ADS1192_reg_CONFIG_2,
                                       (uint8_t *) &conf2Reg,
                                       &ecgErr);
    }
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    // configure RLD_SENS register - both channels P+ and N- for RLD-off detection
    uint8_t rldSensReg = BSP_ECG_ADS1192_RLD_OFF_BOTH_CHANNELS;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_RLD_SENS, &rldSensReg, &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // issue read command
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);
    }

    // read Lead-off Status register
    uint8_t outData[10] = { 0u };
    uint8_t status;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        status = BSP_ECG_ADS1192_readSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF_STAT, &(outData[0]), &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // check if any LEAD_OFF bit is set
        if((status & BSP_ECG_ADS1192_LEAD_OFF_MASK) != false) {
            ecgErr = BSP_ECG_ADS1192_err_RLD_OFF;
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for converting output signal into usable value.
 * @details Converts 8-bit output signal array into correct 16-bit
 *          twos-complement values (amplitudes).
 ******************************************************************************
 * @param [in]  *inData    - pointer to input data array.
 * @param [in]  inDataSize - input data array size.
 * @param [out] *outData   - pointer to output data array.
 * @param [out] *outErr    - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    05.12.2020
 ******************************************************************************/
static inline void BSP_ECG_ADS1192_convertSignal(const uint8_t *inData,
        const uint8_t inDataSize,
        int16_t *outData,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    //TODO: [mario.kodba 05-12-2020] check how efficient is this
    // should compile to single instruction?
    for(uint8_t i = 0, j = 0; i < inDataSize - 1; i += 2, j++) {
        uint16_t tmp = *(inData + i + 1) | (*(inData + i) << BSP_ECG_ADS1192_BYTE_SHIFT);
        memcpy((outData + j), &tmp, sizeof(int16_t));
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 *                          END OF FILE
 ******************************************************************************/
